app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GvKNlIKHwWvxl0Q1fBU-5w"], ["updated_at", "2021-05-25 02:06:29.108403"], ["id", 6]]
---
  def reset_sesssion_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!